__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_depth (InputLayer)        (None, 1, 96, 96)    0                                            
__________________________________________________________________________________________________
input_rgb (InputLayer)          (None, 3, 96, 96)    0                                            
__________________________________________________________________________________________________
input_depth_1_conv (Conv2D)     (None, 24, 96, 96)   216         input_depth[0][0]                
__________________________________________________________________________________________________
input_rgb_1_conv (Conv2D)       (None, 24, 96, 96)   648         input_rgb[0][0]                  
__________________________________________________________________________________________________
input_depth_1_bn (BatchNormaliz (None, 24, 96, 96)   96          input_depth_1_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_1_bn (BatchNormalizat (None, 24, 96, 96)   96          input_rgb_1_conv[0][0]           
__________________________________________________________________________________________________
input_depth_1_act (Activation)  (None, 24, 96, 96)   0           input_depth_1_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_1_act (Activation)    (None, 24, 96, 96)   0           input_rgb_1_bn[0][0]             
__________________________________________________________________________________________________
input_depth_2_conv (Conv2D)     (None, 24, 96, 96)   5184        input_depth_1_act[0][0]          
__________________________________________________________________________________________________
input_rgb_2_conv (Conv2D)       (None, 24, 96, 96)   5184        input_rgb_1_act[0][0]            
__________________________________________________________________________________________________
input_depth_2_bn (BatchNormaliz (None, 24, 96, 96)   96          input_depth_2_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_2_bn (BatchNormalizat (None, 24, 96, 96)   96          input_rgb_2_conv[0][0]           
__________________________________________________________________________________________________
input_depth_2_act (Activation)  (None, 24, 96, 96)   0           input_depth_2_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_2_act (Activation)    (None, 24, 96, 96)   0           input_rgb_2_bn[0][0]             
__________________________________________________________________________________________________
input_depth_3_conv (Conv2D)     (None, 24, 96, 96)   5184        input_depth_2_act[0][0]          
__________________________________________________________________________________________________
input_rgb_3_conv (Conv2D)       (None, 24, 96, 96)   5184        input_rgb_2_act[0][0]            
__________________________________________________________________________________________________
input_depth_3_bn (BatchNormaliz (None, 24, 96, 96)   96          input_depth_3_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_3_bn (BatchNormalizat (None, 24, 96, 96)   96          input_rgb_3_conv[0][0]           
__________________________________________________________________________________________________
input_depth_3_act (Activation)  (None, 24, 96, 96)   0           input_depth_3_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_3_act (Activation)    (None, 24, 96, 96)   0           input_rgb_3_bn[0][0]             
__________________________________________________________________________________________________
input_fusion_concat (Concatenat (None, 48, 96, 96)   0           input_depth_3_act[0][0]          
                                                                 input_rgb_3_act[0][0]            
__________________________________________________________________________________________________
input_fusion_conv (Conv2D)      (None, 24, 96, 96)   1152        input_fusion_concat[0][0]        
__________________________________________________________________________________________________
input_fusion_bn (BatchNormaliza (None, 24, 96, 96)   96          input_fusion_conv[0][0]          
__________________________________________________________________________________________________
input_fusion_act (Activation)   (None, 24, 96, 96)   0           input_fusion_bn[0][0]            
__________________________________________________________________________________________________
main_1_pool (MaxPooling2D)      (None, 24, 32, 32)   0           input_fusion_act[0][0]           
__________________________________________________________________________________________________
main_2_conv (Conv2D)            (None, 48, 32, 32)   10368       main_1_pool[0][0]                
__________________________________________________________________________________________________
main_2_bn (BatchNormalization)  (None, 48, 32, 32)   192         main_2_conv[0][0]                
__________________________________________________________________________________________________
main_2_act (Activation)         (None, 48, 32, 32)   0           main_2_bn[0][0]                  
__________________________________________________________________________________________________
main_3_conv (Conv2D)            (None, 48, 32, 32)   20736       main_2_act[0][0]                 
__________________________________________________________________________________________________
main_3_bn (BatchNormalization)  (None, 48, 32, 32)   192         main_3_conv[0][0]                
__________________________________________________________________________________________________
main_3_act (Activation)         (None, 48, 32, 32)   0           main_3_bn[0][0]                  
__________________________________________________________________________________________________
main_4_conv (Conv2D)            (None, 48, 32, 32)   20736       main_3_act[0][0]                 
__________________________________________________________________________________________________
main_4_bn (BatchNormalization)  (None, 48, 32, 32)   192         main_4_conv[0][0]                
__________________________________________________________________________________________________
main_4_act (Activation)         (None, 48, 32, 32)   0           main_4_bn[0][0]                  
__________________________________________________________________________________________________
main_5_pool (MaxPooling2D)      (None, 48, 16, 16)   0           main_4_act[0][0]                 
__________________________________________________________________________________________________
main_6_conv (Conv2D)            (None, 64, 14, 14)   27648       main_5_pool[0][0]                
__________________________________________________________________________________________________
main_6_bn (BatchNormalization)  (None, 64, 14, 14)   256         main_6_conv[0][0]                
__________________________________________________________________________________________________
main_6_act (Activation)         (None, 64, 14, 14)   0           main_6_bn[0][0]                  
__________________________________________________________________________________________________
main_7_conv (Conv2D)            (None, 64, 12, 12)   36864       main_6_act[0][0]                 
__________________________________________________________________________________________________
main_7_bn (BatchNormalization)  (None, 64, 12, 12)   256         main_7_conv[0][0]                
__________________________________________________________________________________________________
main_7_act (Activation)         (None, 64, 12, 12)   0           main_7_bn[0][0]                  
__________________________________________________________________________________________________
main_8_pool (MaxPooling2D)      (None, 64, 6, 6)     0           main_7_act[0][0]                 
__________________________________________________________________________________________________
output_1_flatten (Flatten)      (None, 2304)         0           main_8_pool[0][0]                
__________________________________________________________________________________________________
output_2_dropout (Dropout)      (None, 2304)         0           output_1_flatten[0][0]           
__________________________________________________________________________________________________
output_2_dense (Dense)          (None, 512)          1180160     output_2_dropout[0][0]           
__________________________________________________________________________________________________
output_2_act (Activation)       (None, 512)          0           output_2_dense[0][0]             
__________________________________________________________________________________________________
output_3_dropout (Dropout)      (None, 512)          0           output_2_act[0][0]               
__________________________________________________________________________________________________
output_3_dense_and_act (Dense)  (None, 2)            1026        output_3_dropout[0][0]           
==================================================================================================
Total params: 1,322,050
Trainable params: 1,321,170
Non-trainable params: 880
__________________________________________________________________________________________________
