_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_depth (InputLayer)     (None, 1, 126, 48)        0         
_________________________________________________________________
input_depth_1_conv (Conv2D)  (None, 24, 126, 48)       216       
_________________________________________________________________
input_depth_1_bn (BatchNorma (None, 24, 126, 48)       96        
_________________________________________________________________
input_depth_1_act (Activatio (None, 24, 126, 48)       0         
_________________________________________________________________
input_depth_2_conv (Conv2D)  (None, 24, 126, 48)       5184      
_________________________________________________________________
input_depth_2_bn (BatchNorma (None, 24, 126, 48)       96        
_________________________________________________________________
input_depth_2_act (Activatio (None, 24, 126, 48)       0         
_________________________________________________________________
input_depth_3_conv (Conv2D)  (None, 24, 126, 48)       5184      
_________________________________________________________________
input_depth_3_bn (BatchNorma (None, 24, 126, 48)       96        
_________________________________________________________________
input_depth_3_act (Activatio (None, 24, 126, 48)       0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 42, 24)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 42, 24)        10368     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 42, 24)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 42, 24)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 42, 24)        20736     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 42, 24)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 42, 24)        0         
_________________________________________________________________
main_4_conv (Conv2D)         (None, 48, 42, 24)        20736     
_________________________________________________________________
main_4_bn (BatchNormalizatio (None, 48, 42, 24)        192       
_________________________________________________________________
main_4_act (Activation)      (None, 48, 42, 24)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 14, 12)        0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 12, 10)        27648     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 12, 10)        256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 12, 10)        0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 10, 8)         36864     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 10, 8)         256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 10, 8)         0         
_________________________________________________________________
main_8_pool (MaxPooling2D)   (None, 64, 5, 4)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1280)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1280)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               655872    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 1)                 513       
=================================================================
Total params: 784,697
Trainable params: 784,009
Non-trainable params: 688
_________________________________________________________________
