_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_rgb (InputLayer)       (None, 3, 48, 48)         0         
_________________________________________________________________
input_rgb_1_conv (Conv2D)    (None, 24, 48, 48)        648       
_________________________________________________________________
input_rgb_1_bn (BatchNormali (None, 24, 48, 48)        96        
_________________________________________________________________
input_rgb_1_act (Activation) (None, 24, 48, 48)        0         
_________________________________________________________________
input_rgb_2_conv (Conv2D)    (None, 24, 48, 48)        5184      
_________________________________________________________________
input_rgb_2_bn (BatchNormali (None, 24, 48, 48)        96        
_________________________________________________________________
input_rgb_2_act (Activation) (None, 24, 48, 48)        0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 24, 24)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 24, 24)        10368     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 24, 24)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 24, 24)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 24, 24)        20736     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 24, 24)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 24, 24)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 12, 12)        0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 10, 10)        27648     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 10, 10)        256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 10, 10)        0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 8, 8)          36864     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 8, 8)          256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 8, 8)          0         
_________________________________________________________________
main_8_pool (MaxPooling2D)   (None, 64, 4, 4)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1024)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1024)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               524800    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 2)                 1026      
=================================================================
Total params: 628,362
Trainable params: 627,818
Non-trainable params: 544
_________________________________________________________________
