_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_rgb (InputLayer)       (None, 3, 96, 96)         0         
_________________________________________________________________
input_rgb_1_conv (Conv2D)    (None, 24, 96, 96)        648       
_________________________________________________________________
input_rgb_1_bn (BatchNormali (None, 24, 96, 96)        96        
_________________________________________________________________
input_rgb_1_act (Activation) (None, 24, 96, 96)        0         
_________________________________________________________________
input_rgb_2_conv (Conv2D)    (None, 24, 96, 96)        5184      
_________________________________________________________________
input_rgb_2_bn (BatchNormali (None, 24, 96, 96)        96        
_________________________________________________________________
input_rgb_2_act (Activation) (None, 24, 96, 96)        0         
_________________________________________________________________
input_rgb_3_conv (Conv2D)    (None, 24, 96, 96)        5184      
_________________________________________________________________
input_rgb_3_bn (BatchNormali (None, 24, 96, 96)        96        
_________________________________________________________________
input_rgb_3_act (Activation) (None, 24, 96, 96)        0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 32, 32)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 32, 32)        10368     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 32, 32)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 32, 32)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 32, 32)        20736     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 32, 32)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 32, 32)        0         
_________________________________________________________________
main_4_conv (Conv2D)         (None, 48, 32, 32)        20736     
_________________________________________________________________
main_4_bn (BatchNormalizatio (None, 48, 32, 32)        192       
_________________________________________________________________
main_4_act (Activation)      (None, 48, 32, 32)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 16, 16)        0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 14, 14)        27648     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 14, 14)        256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 14, 14)        0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 12, 12)        36864     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 12, 12)        256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 12, 12)        0         
_________________________________________________________________
main_8_pool (MaxPooling2D)   (None, 64, 6, 6)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 2304)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 2304)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               1180160   
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 2)                 1026      
=================================================================
Total params: 1,309,930
Trainable params: 1,309,242
Non-trainable params: 688
_________________________________________________________________
