_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_depth (InputLayer)     (None, 96, 96, 1)         0         
_________________________________________________________________
mobilenetv2_0.35_96 (Model)  (None, 1280)              409920    
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1280)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1280)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               655872    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 1)                 513       
=================================================================
Total params: 1,066,305
Trainable params: 1,052,225
Non-trainable params: 14,080
_________________________________________________________________
