_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_rgb (InputLayer)       (None, 96, 96, 3)         0         
_________________________________________________________________
mobilenetv2_0.75_96 (Model)  (None, 1280)              1382064   
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1280)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1280)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               655872    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 1)                 513       
=================================================================
Total params: 2,038,449
Trainable params: 2,011,809
Non-trainable params: 26,640
_________________________________________________________________
