_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_rgb (InputLayer)       (None, 96, 96, 3)         0         
_________________________________________________________________
mobilenetv2_0.50_96 (Model)  (None, 1280)              706224    
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1280)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1280)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               655872    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 2)                 1026      
=================================================================
Total params: 1,363,122
Trainable params: 1,344,578
Non-trainable params: 18,544
_________________________________________________________________
