_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_depth (InputLayer)     (None, 1, 68, 68)         0         
_________________________________________________________________
input_depth_1_conv (Conv2D)  (None, 24, 66, 66)        240       
_________________________________________________________________
input_depth_1_bn (BatchNorma (None, 24, 66, 66)        96        
_________________________________________________________________
input_depth_1_act (Activatio (None, 24, 66, 66)        0         
_________________________________________________________________
input_depth_2_conv (Conv2D)  (None, 24, 64, 64)        5208      
_________________________________________________________________
input_depth_2_bn (BatchNorma (None, 24, 64, 64)        96        
_________________________________________________________________
input_depth_2_act (Activatio (None, 24, 64, 64)        0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 32, 32)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 30, 30)        10416     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 30, 30)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 30, 30)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 28, 28)        20784     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 28, 28)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 28, 28)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 14, 14)        0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 12, 12)        27712     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 12, 12)        256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 12, 12)        0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 10, 10)        36928     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 10, 10)        256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 10, 10)        0         
_________________________________________________________________
main_8_pool (MaxPooling2D)   (None, 64, 5, 5)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1600)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1600)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               819712    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 8)                 4104      
=================================================================
Total params: 926,192
Trainable params: 925,648
Non-trainable params: 544
_________________________________________________________________
