__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_depth (InputLayer)        (None, 1, 46, 46)    0                                            
__________________________________________________________________________________________________
input_rgb (InputLayer)          (None, 3, 46, 46)    0                                            
__________________________________________________________________________________________________
input_depth_1_conv (Conv2D)     (None, 24, 44, 44)   240         input_depth[0][0]                
__________________________________________________________________________________________________
input_rgb_1_conv (Conv2D)       (None, 24, 44, 44)   672         input_rgb[0][0]                  
__________________________________________________________________________________________________
input_depth_1_bn (BatchNormaliz (None, 24, 44, 44)   96          input_depth_1_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_1_bn (BatchNormalizat (None, 24, 44, 44)   96          input_rgb_1_conv[0][0]           
__________________________________________________________________________________________________
input_depth_1_act (Activation)  (None, 24, 44, 44)   0           input_depth_1_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_1_act (Activation)    (None, 24, 44, 44)   0           input_rgb_1_bn[0][0]             
__________________________________________________________________________________________________
input_depth_2_conv (Conv2D)     (None, 24, 42, 42)   5208        input_depth_1_act[0][0]          
__________________________________________________________________________________________________
input_rgb_2_conv (Conv2D)       (None, 24, 42, 42)   5208        input_rgb_1_act[0][0]            
__________________________________________________________________________________________________
input_depth_2_bn (BatchNormaliz (None, 24, 42, 42)   96          input_depth_2_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_2_bn (BatchNormalizat (None, 24, 42, 42)   96          input_rgb_2_conv[0][0]           
__________________________________________________________________________________________________
input_depth_2_act (Activation)  (None, 24, 42, 42)   0           input_depth_2_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_2_act (Activation)    (None, 24, 42, 42)   0           input_rgb_2_bn[0][0]             
__________________________________________________________________________________________________
input_fusion_concat (Concatenat (None, 48, 42, 42)   0           input_depth_2_act[0][0]          
                                                                 input_rgb_2_act[0][0]            
__________________________________________________________________________________________________
input_fusion_conv (Conv2D)      (None, 24, 42, 42)   1176        input_fusion_concat[0][0]        
__________________________________________________________________________________________________
input_fusion_bn (BatchNormaliza (None, 24, 42, 42)   96          input_fusion_conv[0][0]          
__________________________________________________________________________________________________
input_fusion_act (Activation)   (None, 24, 42, 42)   0           input_fusion_bn[0][0]            
__________________________________________________________________________________________________
main_1_pool (MaxPooling2D)      (None, 24, 21, 21)   0           input_fusion_act[0][0]           
__________________________________________________________________________________________________
main_2_conv (Conv2D)            (None, 48, 19, 19)   10416       main_1_pool[0][0]                
__________________________________________________________________________________________________
main_2_bn (BatchNormalization)  (None, 48, 19, 19)   192         main_2_conv[0][0]                
__________________________________________________________________________________________________
main_2_act (Activation)         (None, 48, 19, 19)   0           main_2_bn[0][0]                  
__________________________________________________________________________________________________
main_3_conv (Conv2D)            (None, 48, 17, 17)   20784       main_2_act[0][0]                 
__________________________________________________________________________________________________
main_3_bn (BatchNormalization)  (None, 48, 17, 17)   192         main_3_conv[0][0]                
__________________________________________________________________________________________________
main_3_act (Activation)         (None, 48, 17, 17)   0           main_3_bn[0][0]                  
__________________________________________________________________________________________________
main_5_pad (ZeroPadding2D)      (None, 48, 18, 18)   0           main_3_act[0][0]                 
__________________________________________________________________________________________________
main_5_pool (MaxPooling2D)      (None, 48, 9, 9)     0           main_5_pad[0][0]                 
__________________________________________________________________________________________________
main_6_conv (Conv2D)            (None, 64, 7, 7)     27712       main_5_pool[0][0]                
__________________________________________________________________________________________________
main_6_bn (BatchNormalization)  (None, 64, 7, 7)     256         main_6_conv[0][0]                
__________________________________________________________________________________________________
main_6_act (Activation)         (None, 64, 7, 7)     0           main_6_bn[0][0]                  
__________________________________________________________________________________________________
main_7_conv (Conv2D)            (None, 64, 5, 5)     36928       main_6_act[0][0]                 
__________________________________________________________________________________________________
main_7_bn (BatchNormalization)  (None, 64, 5, 5)     256         main_7_conv[0][0]                
__________________________________________________________________________________________________
main_7_act (Activation)         (None, 64, 5, 5)     0           main_7_bn[0][0]                  
__________________________________________________________________________________________________
output_1_flatten (Flatten)      (None, 1600)         0           main_7_act[0][0]                 
__________________________________________________________________________________________________
output_2_dropout (Dropout)      (None, 1600)         0           output_1_flatten[0][0]           
__________________________________________________________________________________________________
output_2_dense (Dense)          (None, 512)          819712      output_2_dropout[0][0]           
__________________________________________________________________________________________________
output_2_act (Activation)       (None, 512)          0           output_2_dense[0][0]             
__________________________________________________________________________________________________
output_3_dropout (Dropout)      (None, 512)          0           output_2_act[0][0]               
__________________________________________________________________________________________________
output_3_dense_and_act (Dense)  (None, 8)            4104        output_3_dropout[0][0]           
==================================================================================================
Total params: 933,536
Trainable params: 932,848
Non-trainable params: 688
__________________________________________________________________________________________________
