__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_depth (InputLayer)        (None, 1, 68, 68)    0                                            
__________________________________________________________________________________________________
input_rgb (InputLayer)          (None, 3, 68, 68)    0                                            
__________________________________________________________________________________________________
input_depth_1_conv (Conv2D)     (None, 24, 66, 66)   240         input_depth[0][0]                
__________________________________________________________________________________________________
input_rgb_1_conv (Conv2D)       (None, 24, 66, 66)   672         input_rgb[0][0]                  
__________________________________________________________________________________________________
input_depth_1_bn (BatchNormaliz (None, 24, 66, 66)   96          input_depth_1_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_1_bn (BatchNormalizat (None, 24, 66, 66)   96          input_rgb_1_conv[0][0]           
__________________________________________________________________________________________________
input_depth_1_act (Activation)  (None, 24, 66, 66)   0           input_depth_1_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_1_act (Activation)    (None, 24, 66, 66)   0           input_rgb_1_bn[0][0]             
__________________________________________________________________________________________________
input_depth_2_conv (Conv2D)     (None, 24, 64, 64)   5208        input_depth_1_act[0][0]          
__________________________________________________________________________________________________
input_rgb_2_conv (Conv2D)       (None, 24, 64, 64)   5208        input_rgb_1_act[0][0]            
__________________________________________________________________________________________________
input_depth_2_bn (BatchNormaliz (None, 24, 64, 64)   96          input_depth_2_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_2_bn (BatchNormalizat (None, 24, 64, 64)   96          input_rgb_2_conv[0][0]           
__________________________________________________________________________________________________
input_depth_2_act (Activation)  (None, 24, 64, 64)   0           input_depth_2_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_2_act (Activation)    (None, 24, 64, 64)   0           input_rgb_2_bn[0][0]             
__________________________________________________________________________________________________
input_fusion_concat (Concatenat (None, 48, 64, 64)   0           input_depth_2_act[0][0]          
                                                                 input_rgb_2_act[0][0]            
__________________________________________________________________________________________________
input_fusion_conv (Conv2D)      (None, 24, 64, 64)   1176        input_fusion_concat[0][0]        
__________________________________________________________________________________________________
input_fusion_bn (BatchNormaliza (None, 24, 64, 64)   96          input_fusion_conv[0][0]          
__________________________________________________________________________________________________
input_fusion_act (Activation)   (None, 24, 64, 64)   0           input_fusion_bn[0][0]            
__________________________________________________________________________________________________
main_1_pool (MaxPooling2D)      (None, 24, 32, 32)   0           input_fusion_act[0][0]           
__________________________________________________________________________________________________
main_2_conv (Conv2D)            (None, 48, 30, 30)   10416       main_1_pool[0][0]                
__________________________________________________________________________________________________
main_2_bn (BatchNormalization)  (None, 48, 30, 30)   192         main_2_conv[0][0]                
__________________________________________________________________________________________________
main_2_act (Activation)         (None, 48, 30, 30)   0           main_2_bn[0][0]                  
__________________________________________________________________________________________________
main_3_conv (Conv2D)            (None, 48, 28, 28)   20784       main_2_act[0][0]                 
__________________________________________________________________________________________________
main_3_bn (BatchNormalization)  (None, 48, 28, 28)   192         main_3_conv[0][0]                
__________________________________________________________________________________________________
main_3_act (Activation)         (None, 48, 28, 28)   0           main_3_bn[0][0]                  
__________________________________________________________________________________________________
main_5_pool (MaxPooling2D)      (None, 48, 14, 14)   0           main_3_act[0][0]                 
__________________________________________________________________________________________________
main_6_conv (Conv2D)            (None, 64, 12, 12)   27712       main_5_pool[0][0]                
__________________________________________________________________________________________________
main_6_bn (BatchNormalization)  (None, 64, 12, 12)   256         main_6_conv[0][0]                
__________________________________________________________________________________________________
main_6_act (Activation)         (None, 64, 12, 12)   0           main_6_bn[0][0]                  
__________________________________________________________________________________________________
main_7_conv (Conv2D)            (None, 64, 10, 10)   36928       main_6_act[0][0]                 
__________________________________________________________________________________________________
main_7_bn (BatchNormalization)  (None, 64, 10, 10)   256         main_7_conv[0][0]                
__________________________________________________________________________________________________
main_7_act (Activation)         (None, 64, 10, 10)   0           main_7_bn[0][0]                  
__________________________________________________________________________________________________
main_8_pool (MaxPooling2D)      (None, 64, 5, 5)     0           main_7_act[0][0]                 
__________________________________________________________________________________________________
output_1_flatten (Flatten)      (None, 1600)         0           main_8_pool[0][0]                
__________________________________________________________________________________________________
output_2_dropout (Dropout)      (None, 1600)         0           output_1_flatten[0][0]           
__________________________________________________________________________________________________
output_2_dense (Dense)          (None, 512)          819712      output_2_dropout[0][0]           
__________________________________________________________________________________________________
output_2_act (Activation)       (None, 512)          0           output_2_dense[0][0]             
__________________________________________________________________________________________________
output_3_dropout (Dropout)      (None, 512)          0           output_2_act[0][0]               
__________________________________________________________________________________________________
output_3_dense_and_act (Dense)  (None, 1)            513         output_3_dropout[0][0]           
==================================================================================================
Total params: 929,945
Trainable params: 929,257
Non-trainable params: 688
__________________________________________________________________________________________________
