__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_depth (InputLayer)        (None, 1, 123, 54)   0                                            
__________________________________________________________________________________________________
input_rgb (InputLayer)          (None, 3, 123, 54)   0                                            
__________________________________________________________________________________________________
input_depth_1_conv (Conv2D)     (None, 24, 121, 52)  240         input_depth[0][0]                
__________________________________________________________________________________________________
input_rgb_1_conv (Conv2D)       (None, 24, 121, 52)  672         input_rgb[0][0]                  
__________________________________________________________________________________________________
input_depth_1_bn (BatchNormaliz (None, 24, 121, 52)  96          input_depth_1_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_1_bn (BatchNormalizat (None, 24, 121, 52)  96          input_rgb_1_conv[0][0]           
__________________________________________________________________________________________________
input_depth_1_act (Activation)  (None, 24, 121, 52)  0           input_depth_1_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_1_act (Activation)    (None, 24, 121, 52)  0           input_rgb_1_bn[0][0]             
__________________________________________________________________________________________________
input_depth_2_conv (Conv2D)     (None, 24, 119, 50)  5208        input_depth_1_act[0][0]          
__________________________________________________________________________________________________
input_rgb_2_conv (Conv2D)       (None, 24, 119, 50)  5208        input_rgb_1_act[0][0]            
__________________________________________________________________________________________________
input_depth_2_bn (BatchNormaliz (None, 24, 119, 50)  96          input_depth_2_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_2_bn (BatchNormalizat (None, 24, 119, 50)  96          input_rgb_2_conv[0][0]           
__________________________________________________________________________________________________
input_depth_2_act (Activation)  (None, 24, 119, 50)  0           input_depth_2_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_2_act (Activation)    (None, 24, 119, 50)  0           input_rgb_2_bn[0][0]             
__________________________________________________________________________________________________
input_depth_3_conv (Conv2D)     (None, 24, 117, 48)  5208        input_depth_2_act[0][0]          
__________________________________________________________________________________________________
input_rgb_3_conv (Conv2D)       (None, 24, 117, 48)  5208        input_rgb_2_act[0][0]            
__________________________________________________________________________________________________
input_depth_3_bn (BatchNormaliz (None, 24, 117, 48)  96          input_depth_3_conv[0][0]         
__________________________________________________________________________________________________
input_rgb_3_bn (BatchNormalizat (None, 24, 117, 48)  96          input_rgb_3_conv[0][0]           
__________________________________________________________________________________________________
input_depth_3_act (Activation)  (None, 24, 117, 48)  0           input_depth_3_bn[0][0]           
__________________________________________________________________________________________________
input_rgb_3_act (Activation)    (None, 24, 117, 48)  0           input_rgb_3_bn[0][0]             
__________________________________________________________________________________________________
input_fusion_concat (Concatenat (None, 48, 117, 48)  0           input_depth_3_act[0][0]          
                                                                 input_rgb_3_act[0][0]            
__________________________________________________________________________________________________
input_fusion_conv (Conv2D)      (None, 24, 117, 48)  1176        input_fusion_concat[0][0]        
__________________________________________________________________________________________________
input_fusion_bn (BatchNormaliza (None, 24, 117, 48)  96          input_fusion_conv[0][0]          
__________________________________________________________________________________________________
input_fusion_act (Activation)   (None, 24, 117, 48)  0           input_fusion_bn[0][0]            
__________________________________________________________________________________________________
main_1_pool (MaxPooling2D)      (None, 24, 39, 24)   0           input_fusion_act[0][0]           
__________________________________________________________________________________________________
main_2_conv (Conv2D)            (None, 48, 37, 22)   10416       main_1_pool[0][0]                
__________________________________________________________________________________________________
main_2_bn (BatchNormalization)  (None, 48, 37, 22)   192         main_2_conv[0][0]                
__________________________________________________________________________________________________
main_2_act (Activation)         (None, 48, 37, 22)   0           main_2_bn[0][0]                  
__________________________________________________________________________________________________
main_3_conv (Conv2D)            (None, 48, 35, 20)   20784       main_2_act[0][0]                 
__________________________________________________________________________________________________
main_3_bn (BatchNormalization)  (None, 48, 35, 20)   192         main_3_conv[0][0]                
__________________________________________________________________________________________________
main_3_act (Activation)         (None, 48, 35, 20)   0           main_3_bn[0][0]                  
__________________________________________________________________________________________________
main_4_conv (Conv2D)            (None, 48, 33, 18)   20784       main_3_act[0][0]                 
__________________________________________________________________________________________________
main_4_bn (BatchNormalization)  (None, 48, 33, 18)   192         main_4_conv[0][0]                
__________________________________________________________________________________________________
main_4_act (Activation)         (None, 48, 33, 18)   0           main_4_bn[0][0]                  
__________________________________________________________________________________________________
main_5_pool (MaxPooling2D)      (None, 48, 11, 6)    0           main_4_act[0][0]                 
__________________________________________________________________________________________________
main_6_conv (Conv2D)            (None, 64, 9, 4)     27712       main_5_pool[0][0]                
__________________________________________________________________________________________________
main_6_bn (BatchNormalization)  (None, 64, 9, 4)     256         main_6_conv[0][0]                
__________________________________________________________________________________________________
main_6_act (Activation)         (None, 64, 9, 4)     0           main_6_bn[0][0]                  
__________________________________________________________________________________________________
main_7_conv (Conv2D)            (None, 64, 7, 2)     36928       main_6_act[0][0]                 
__________________________________________________________________________________________________
main_7_bn (BatchNormalization)  (None, 64, 7, 2)     256         main_7_conv[0][0]                
__________________________________________________________________________________________________
main_7_act (Activation)         (None, 64, 7, 2)     0           main_7_bn[0][0]                  
__________________________________________________________________________________________________
output_1_flatten (Flatten)      (None, 896)          0           main_7_act[0][0]                 
__________________________________________________________________________________________________
output_2_dropout (Dropout)      (None, 896)          0           output_1_flatten[0][0]           
__________________________________________________________________________________________________
output_2_dense (Dense)          (None, 512)          459264      output_2_dropout[0][0]           
__________________________________________________________________________________________________
output_2_act (Activation)       (None, 512)          0           output_2_dense[0][0]             
__________________________________________________________________________________________________
output_3_dropout (Dropout)      (None, 512)          0           output_2_act[0][0]               
__________________________________________________________________________________________________
output_3_dense_and_act (Dense)  (None, 8)            4104        output_3_dropout[0][0]           
==================================================================================================
Total params: 604,672
Trainable params: 603,792
Non-trainable params: 880
__________________________________________________________________________________________________
