_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_depth (InputLayer)     (None, 1, 46, 46)         0         
_________________________________________________________________
input_depth_1_conv (Conv2D)  (None, 24, 44, 44)        240       
_________________________________________________________________
input_depth_1_bn (BatchNorma (None, 24, 44, 44)        96        
_________________________________________________________________
input_depth_1_act (Activatio (None, 24, 44, 44)        0         
_________________________________________________________________
input_depth_2_conv (Conv2D)  (None, 24, 42, 42)        5208      
_________________________________________________________________
input_depth_2_bn (BatchNorma (None, 24, 42, 42)        96        
_________________________________________________________________
input_depth_2_act (Activatio (None, 24, 42, 42)        0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 21, 21)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 19, 19)        10416     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 19, 19)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 19, 19)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 17, 17)        20784     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 17, 17)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 17, 17)        0         
_________________________________________________________________
main_5_pad (ZeroPadding2D)   (None, 48, 18, 18)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 9, 9)          0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 7, 7)          27712     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 7, 7)          256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 7, 7)          0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 5, 5)          36928     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 5, 5)          256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 5, 5)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 1600)              0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 1600)              0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               819712    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 2)                 1026      
=================================================================
Total params: 923,114
Trainable params: 922,570
Non-trainable params: 544
_________________________________________________________________
