_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_depth (InputLayer)     (None, 1, 123, 54)        0         
_________________________________________________________________
input_depth_1_conv (Conv2D)  (None, 24, 121, 52)       240       
_________________________________________________________________
input_depth_1_bn (BatchNorma (None, 24, 121, 52)       96        
_________________________________________________________________
input_depth_1_act (Activatio (None, 24, 121, 52)       0         
_________________________________________________________________
input_depth_2_conv (Conv2D)  (None, 24, 119, 50)       5208      
_________________________________________________________________
input_depth_2_bn (BatchNorma (None, 24, 119, 50)       96        
_________________________________________________________________
input_depth_2_act (Activatio (None, 24, 119, 50)       0         
_________________________________________________________________
input_depth_3_conv (Conv2D)  (None, 24, 117, 48)       5208      
_________________________________________________________________
input_depth_3_bn (BatchNorma (None, 24, 117, 48)       96        
_________________________________________________________________
input_depth_3_act (Activatio (None, 24, 117, 48)       0         
_________________________________________________________________
main_1_pool (MaxPooling2D)   (None, 24, 39, 24)        0         
_________________________________________________________________
main_2_conv (Conv2D)         (None, 48, 37, 22)        10416     
_________________________________________________________________
main_2_bn (BatchNormalizatio (None, 48, 37, 22)        192       
_________________________________________________________________
main_2_act (Activation)      (None, 48, 37, 22)        0         
_________________________________________________________________
main_3_conv (Conv2D)         (None, 48, 35, 20)        20784     
_________________________________________________________________
main_3_bn (BatchNormalizatio (None, 48, 35, 20)        192       
_________________________________________________________________
main_3_act (Activation)      (None, 48, 35, 20)        0         
_________________________________________________________________
main_4_conv (Conv2D)         (None, 48, 33, 18)        20784     
_________________________________________________________________
main_4_bn (BatchNormalizatio (None, 48, 33, 18)        192       
_________________________________________________________________
main_4_act (Activation)      (None, 48, 33, 18)        0         
_________________________________________________________________
main_5_pool (MaxPooling2D)   (None, 48, 11, 6)         0         
_________________________________________________________________
main_6_conv (Conv2D)         (None, 64, 9, 4)          27712     
_________________________________________________________________
main_6_bn (BatchNormalizatio (None, 64, 9, 4)          256       
_________________________________________________________________
main_6_act (Activation)      (None, 64, 9, 4)          0         
_________________________________________________________________
main_7_conv (Conv2D)         (None, 64, 7, 2)          36928     
_________________________________________________________________
main_7_bn (BatchNormalizatio (None, 64, 7, 2)          256       
_________________________________________________________________
main_7_act (Activation)      (None, 64, 7, 2)          0         
_________________________________________________________________
output_1_flatten (Flatten)   (None, 896)               0         
_________________________________________________________________
output_2_dropout (Dropout)   (None, 896)               0         
_________________________________________________________________
output_2_dense (Dense)       (None, 512)               459264    
_________________________________________________________________
output_2_act (Activation)    (None, 512)               0         
_________________________________________________________________
output_3_dropout (Dropout)   (None, 512)               0         
_________________________________________________________________
output_3_dense_and_act (Dens (None, 8)                 4104      
=================================================================
Total params: 592,024
Trainable params: 591,336
Non-trainable params: 688
_________________________________________________________________
